app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if !Artist.where(id: params[:artist_id]).empty?
        @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:alert] = "Artist not found."
        redirect_to :controller => 'artists', :action => 'index'
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "artists" WHERE "artists"."id" = ?  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if Song.where(id: params[:id]).empty?
      if params[:artist_id]
        @artist = Artist.find(params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]